{
  "reviews": [
    {
      "authorName": "Rachel S",
      "quote": "The facility is very clean, the teachers are responsible, friendly, and communicate well with parents.",
      "datePublished": "2023",
      "authorImageUrl": "https://lh3.googleusercontent.com/a/ACg8ocJcv3Z5diAbPuQEFaT1-iZHBV-cHAKuK1ijsmqYuzkKwZW4tg=w72-h72-p-rp-mo-ba2-br100"
    },
    {
      "authorName": "Heidy Barros",
      "comment": "We moved from Colombia to Coquitlam last year, and we were so fortunate to find this daycare for our son. It's a great place not only for education but for values. The teachers care about the kids, and my son felt loved all the time. He is now in an elementary school, but everyday he passes by the daycare he stops to say hello to the teachers. Also the facilities are very nice and clean. I highly recommend this daycare if you need a place you can trust for your child to go to.",
      "quote": "We moved from Colombia to Coquitlam last year, and we were so fortunate to find this daycare for our son. It's a great place not only for education but for values. The teachers care about the kids, and my son felt loved all the time.",
      "datePublished": "2021",
      "authorImageUrl": "https://lh3.googleusercontent.com/a-/ALV-UjWtSf5tzfGYRfI9yRzCAePT5lIIEZJ0aVMQ3jutZIMLnstOT5s=w72-h72-p-rp-mo-br100"
    },
    {
      "authorName": "Stella Lu",
      "comment": "We transferred our son to Friendship Corner Daycare at the age of 3, and it turned out to be the best decision that we have made for him. The teachers are all very nice and caring, they gave our son way more attention than his previous daycare, and therefore he was much happier and more confident. They do arts project, drawings and paintings, stories, letters and numbers... my son learned a lot from this daycare! He’s always happy to go to daycare every morning and coming back home with a smile on his face. The facilities are very well organized and super clean. My son has never caught any germ or got sick from daycare. He had a very smooth transition to kindergarten thanks to the great experiences he had with Friendship Corner Daycare. I would highly recommend this daycare to anyone!",
      "quote": "We transferred our son to Friendship Corner Daycare at the age of 3, and it turned out to be the best decision that we have made for him. The teachers are all very nice and caring, they gave our son way more attention than his previous daycare.",
      "datePublished": "2024",
      "authorImageUrl": "https://lh3.googleusercontent.com/a/ACg8ocJiyK_Hdlb7dGpvUB19Ia1rCrKnbFOvcIlkbZI041zh2X2luw=w72-h72-p-rp-mo-br100"
    },
    {
      "authorName": "Michael Magdy",
      "datePublished": "2020",
      "comment": "The day care itself isn't that bad , management thought are completely unprofessional to the point it's funny ,we went there to register our 3 years old sun and when we talked to the Miyuki the owner she started full intergation about our sun after asking all these wired questions at the end she started explaining their rules on how kids must nap ,obey all rules and even don't speak at all . so I told generally our kid is ok but he is still 3 years so he might not nap everyday ,anyway there is a lot to tell but I will make short , I am not sure who Miyuki the owner have a early child hood education and she have no tolerance for kids ."
    },
    {
      "authorName": "Megan Weng",
      "comment": "This daycare can be called a second home for my three children( 7yrs, 5yrs, 4yrs)! The facilities are very nice and clean, teachers are very caring and patient! Nothing to complain about for over five years! My kids are always happy to go to daycare, my kindergarten child still loves to come back to the daycare for summer vacation. I highly recommend this daycare if you would like to find a worry free place for your child to go to!",
      "quote": "This daycare can be called a second home for my three children (7yrs, 5yrs, 4yrs)! The facilities are very nice and clean, teachers are very caring and patient! Nothing to complain about for over five years! My kids are always happy to go there.",
      "datePublished": "2025",
      "authorImageUrl": "https://lh3.googleusercontent.com/a/ACg8ocJRM6BK-FdSRnJG4UHIklJorrKNntaS8ucDh9DDpGf4bx6nZw=w72-h72-p-rp-mo-br100"
    },
    {
      "authorName": "Isabel Liu",
      "comment": "The daycare itself is a great place, the insides are sanitary and everything is organized very well. The staff are very caring towards all the children they also plan a lot of small arts and crafts for the child to do each week. I have been a parent of this daycare for over 7 years and I have never once had a problem with leaving my child there while I went to work. My children love it there they always go home with a smile telling me about the great day they've had at daycare.",
      "quote": "The daycare itself is a great place, the insides are sanitary and everything is organized very well. The staff are very caring towards all the children they also plan a lot of small arts and crafts for the child to do each week.",
      "datePublished": "2024",
      "authorImageUrl": "https://lh3.googleusercontent.com/a-/ALV-UjVu6rp9cEmAhKsx-omZFMGHm-VP0V2wLIuQAc_IiEskqKpXWAoA=w72-h72-p-rp-mo-br100"
    },
    {
      "authorName": "鲁南宋",
      "comment": "My daughter went to two daycares before she joined Friendship corner, this is the best one, the classroom is always clean, we have never had issues of getting infected with flu or diarrhea, which we had a lot in the previous daycare. Teachers are very professional, my daughter’s English improved a lot in short time, she not only learned lower case letters but also phonics and she soon learned to spell the words. The art works are very creative too! Everyday when I go to pick her up she would ‘play a little bit longer’. Everything here is well organized and I always know what they are doing. The daycare locates in a church, has its own playground, very safe.",
      "quote": "我女儿在加入友谊角之前去过两家日托，这是最好的一家。教室总是很干净，我们从未感染流感或腹泻，而在之前的日托经常发生。",
      "datePublished": "2019",
      "authorImageUrl": "https://lh3.googleusercontent.com/a/ACg8ocKH0Qe2xWoLvChThanZYP4Qm6eBIiu2cAVoHUJ5saCdeSDmoA=w72-h72-p-rp-mo-br100"
    },
    {
      "authorName": "Tang Wangbeiwei",
      "comment": "Especially good daycare, the teacher is very nice and responsible. My daughter is very happy every day in this daycare and she learned a lot. She can read the words, read some simple sentences and do simple maths. She also learned a lot of knowledge in world, did lot of arts every week .Moreover, she is more independent in life. Thank teachers.",
      "quote": "Especially good daycare, the teacher is very nice and responsible. My daughter is very happy every day in this daycare and she learned a lot. She can read the words, read some simple sentences and do simple maths. She also learned a lot of different things.",
      "datePublished": "2023",
      "authorImageUrl": "https://lh3.googleusercontent.com/a-/ALV-UjW9b4kE8xJS3bwJWxgUf96PrUcYDv1UEt82AnzkdAkQlSzH9Y6-Tw=w72-h72-p-rp-mo-br100"
    },
    {
      "authorName": "Kevin Tam",
      "comment": "We are very blessed to have our son attended this daycare for two years. All the staff are always welcoming and caring to our child. The children learn many life skills and academic skills there, as well as social and emotional learnings. It's a very clean and organized facility. Communication to parents are timely and clear. The staff truly cares about children's development in their tender years. We highly recommend this daycare to anyone.",
      "quote": "We are very blessed to have our son attended this daycare for two years. All the staff are always welcoming and caring to our child. The children learn many life skills and academic skills there, as well as social and emotional learnings.",
      "datePublished": "2016",
      "authorImageUrl": "https://lh3.googleusercontent.com/a/ACg8ocKzB1JdGPfpGKmHhYRa4DVLr05bVBOAmBhyOt1cbO_JnSVThA=w72-h72-p-rp-mo-br100"
    },
    {
      "authorName": "Jie Liu",
      "comment": "This daycare is awsome. My wife and I had visited more than ten daycares before we decided to send our daughter to this one although it is 17 kms away from our home. The teachers are patient and love children. Each Friday, my daughter will bring home a lot of ARTs she made in the week. You will know what beautiful things she can make. She was always happy to go to the daycare and sing a song she learned at the circle time. She also got good training on letters, numbers, and colors. Her English improved a lot while English is our second language. We are very happy to see her grow and learn in the daycare. Now she entered the kindergarten. Since she had a good performance on an interview before the admission, she was admitted to the class mixture with grade one students. Her transition from daycare to school is very smooth. The daycare is excellent in providing a clean and healthy environment to children. My daughter had never been affected a flu from other kids in the daycare. We highly recommend Friendship daycare if you are looking for a daycare for your loved ones.",
      "datePublished": "2025"
    },
    {
      "authorName": "Jiele",
      "comment": "The teachers there are all very kind and never speak loudly to the children. They genuinely love children, and my child loves this kindergarten. The kindergarten is also very clean every day. Since we switched to this kindergarten, my child has gotten sick less often. The kindergarten often does crafts, which my son especially loves. The kindergarten also has teaching notebooks for each child, recording which letters, numbers, and other knowledge each child has learned. So I highly recommend this kindergarten. My child has received excellent care here, and sometimes when I pick him up in the evening, he even wants to play a little longer.",
      "quote": "The teachers there are all very kind and never speak loudly to the children. They genuinely love children, and my child loves this kindergarten. The kindergarten is also very clean every day. Since we switched to this kindergarten, my child has improved a lot.",
      "datePublished": "2024",
      "authorImageUrl": null
    }
  ]
}
